; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph6 - mode
	thermograph1 - mode
	infrared2 - mode
	image4 - mode
	image5 - mode
	infrared3 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star11 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image5)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation12)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph6)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation13)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
)
(:goal (and
	(have_image Phenomenon14 image5)
	(have_image Phenomenon14 image4)
	(have_image Phenomenon15 spectrograph0)
	(have_image Phenomenon15 infrared3)
	(have_image Phenomenon16 spectrograph0)
	(have_image Phenomenon16 infrared2)
	(have_image Planet17 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation6 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon14 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon14 instrument0 image5)
   added: (have_image phenomenon14 image5)
   goals met: 1 of 7
6. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 7
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
8. (turn_to satellite0 groundstation13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation13)
   goals met: 1 of 7
9. (calibrate satellite0 instrument1 groundstation13)
   added: (calibrated instrument1)
   goals met: 1 of 7
10. (turn_to satellite0 groundstation10 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 7
11. (turn_to satellite0 phenomenon14 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 7
12. (take_image satellite0 phenomenon14 instrument1 image4)
   added: (have_image phenomenon14 image4)
   goals met: 2 of 7
13. (turn_to satellite0 groundstation10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation10)
   goals met: 2 of 7
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 7
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 7
16. (calibrate satellite0 instrument2 groundstation10)
   added: (calibrated instrument2)
   goals met: 2 of 7
17. (turn_to satellite0 phenomenon15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 7
18. (take_image satellite0 phenomenon15 instrument2 infrared3)
   added: (have_image phenomenon15 infrared3)
   goals met: 3 of 7
19. (take_image satellite0 phenomenon15 instrument2 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 4 of 7
20. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 7
21. (take_image satellite0 phenomenon16 instrument2 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 5 of 7
22. (take_image satellite0 phenomenon16 instrument2 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 6 of 7
23. (turn_to satellite0 planet17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet17)
   goals met: 6 of 7
24. (take_image satellite0 planet17 instrument2 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 7 of 7
